-- SQLite
CREATE TABLE shifts (
    employee_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    skills TEXT,
    desired_date DATE,
    clock_in TIME,
    clock_out TIME
);

INSERT INTO shifts (employee_id, name, skills, desired_date, clock_in, clock_out) VALUES
(1, '田中', 'レジ, 品出し,冷蔵', '2024-07-01', '09:00', '14:00'),
(2, '鈴木', 'レジ,品出し,冷蔵', '2024-07-01', '09:00', '14:00'),
(3, '佐藤', 'レジ,品出し', '2024-07-01', '09:00', '17:00'),
(4, '中田', 'レジ,品出し', '2024-07-01', '09:00', '17:00'),
(5, '林', 'レジ,品出し,冷蔵', '2024-07-01', '12:00', '20:00'),
(6, '中村', 'レジ,品出し', '2024-07-01', '12:00', '18:00'),
(7, '縁下', 'レジ,品出し,冷蔵', '2024-07-01', '14:00', '20:00'),
(8, '東', '品出し', '2024-07-01', '13:00', '20:00'),
(9, '日向', 'レジ,品出し,冷蔵', '2024-07-01', '09:00', '14:00'),
(10, '西谷', 'レジ,品出し', '2024-07-01', NULL, NULL),
(11, '影山', 'レジ,品出し,冷蔵', '2024-07-01', '09:00', '14:00'),
(12, '月島', 'レジ,品出し', '2024-07-01', '12:00', '18:00'),
(13, '山口', '品出し,冷蔵', '2024-07-01', '12:00', '20:00'),
(14, '澤村', 'レジ,品出し', '2024-07-01', NULL, NULL),
(15, '菅原', 'レジ,品出し,冷蔵', '2024-07-01', '17:00', '20:00'),
(16, '成田', 'レジ,品出し', '2024-07-01', NULL, NULL),
(17, '木下', 'レジ,品出し,冷蔵', '2024-07-01', '12:00', '18:00'),
(18, '清水', 'レジ,品出し', '2024-07-01', NULL, NULL);
